In [1]:
# impotação do pandas

import pandas as pd        # biblioteca para manipulação de dados
import numpy as np         # biblioteca para calculos matematicos
import html5lib            # biblioteca para leitura de arquivos html
import json                # biblioteca para leitura de arquivos json

In [2]:
# criando um dicionario

dict = {'a': 5, 'b': 'cat', 'c': 42}

In [3]:
# transformando dicionario em uma serie pandas

pd.Series(dict)

a      5
b    cat
c     42
dtype: object

In [4]:
# criando uma serie pandas

oneD = pd.Series([100, 'cat', 310, 'gog', 500], 
                 ['Amy', 'Bobby', 'Cat', 'Dom', 'Ema'])
oneD

Amy      100
Bobby    cat
Cat      310
Dom      gog
Ema      500
dtype: object

In [5]:
# definição do indice da serie

oneD = pd.Series([100, 'cat', 310, 'gog', 500], 
                 index=['Amy', 'Bobby', 'Cat', 'Dom', 'Ema'])
oneD

Amy      100
Bobby    cat
Cat      310
Dom      gog
Ema      500
dtype: object

In [6]:
# retornando os valores das chaves

oneD.loc[['Cat', 'Ema']]

Cat    310
Ema    500
dtype: object

In [7]:
# busca por valores especificos no indice

oneD.iloc[1]

'cat'

In [8]:
# diferenças

'Cat' in oneD, 'cat' in oneD

(True, False)

In [9]:
# criando um dicionario

d = {'A': pd.Series([5., 2., 3.], index=['Maça', 'Pera', 'Laranja']), 
     'B': pd.Series([10., 20., 30., 40.], index=['Maça', 'Pera', 'Laranja', 'Melão'])}

In [10]:
# transformando dicionario em dataframe

df = pd.DataFrame(d)
df

           A     B
Laranja  3.0  30.0
Maça     5.0  10.0
Melão    NaN  40.0
Pera     2.0  20.0

In [11]:
# imprimindo tipo

print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
# filto dataframe

pd.DataFrame(df, index=['Laranja', 'Melão', 'Maça'], columns=['A'])

           A
Laranja  3.0
Melão    NaN
Maça     5.0

In [13]:
# importando dados de um arquivo csv

dataset = pd.read_csv('./data/Resp2.csv')

In [14]:
# visualizando os primeiros dados

dataset.head()

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07

In [15]:
# visualizando os ultimos dados

dataset.tail()

    experience  respiration
27           3         3.61
28           3         3.32
29           3         3.20
30           3         3.35
31           3         3.18

In [16]:
# importando dados 

dataset2 = pd.read_csv('./data/Winequality-red.csv')

In [17]:
# visualizando os primeiros dados

dataset2.head()

  fixed acidity;"volatile acidity";"citric acid";"residual sugar";"chlorides";"free sulfur dioxide";"total sulfur dioxide";"density";"pH";"sulphates";"alcohol";"quality"
0   7.4;0.7;0;1.9;0.076;11;34;0.9978;3.51;0.56;9.4;5
1   7.8;0.88;0;2.6;0.098;25;67;0.9968;3.2;0.68;9.8;5
2  7.8;0.76;0.04;2.3;0.092;15;54;0.997;3.26;0.65;...
3  11.2;0.28;0.56;1.9;0.075;17;60;0.998;3.16;0.58...
4   7.4;0.7;0;1.9;0.076;11;34;0.9978;3.51;0.56;9.4;5

In [18]:
# alterando os parametros para importação dos dados
# delimiter = ';'

dataset2 = pd.read_csv('./data/Winequality-red.csv', sep=';')

In [19]:
# visualizando os primeiros dados

dataset2.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [20]:
# alterando os parametros para importação dos dados
# delimiter = '\t'

dataset2 = pd.read_csv('./data/bostonTxt.txt', sep='\t')

In [21]:
# visualizando os primeiros dados

dataset2.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

In [22]:
# importando dados de um arquivo Excel

dataset2 = pd.ExcelFile('./data/boston1.xls')

In [23]:
# visualizando quantidade de planilhas do arquivo

print(dataset2.sheet_names)

['Sheet1', 'Sheet2']

In [24]:
# transformando planilha 2 em dataframe e visualizando os primeiros dados

dataset21 =dataset2.parse('Sheet2')
dataset21.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

In [25]:
# importando dados HTML

dataset2 = pd.read_html('https://pt.wikipedia.org/wiki/Unidades_federativas_do_Brasil')

In [26]:
# imprimindo o tipo de dados

print(type(dataset2))

<class 'list'>

In [27]:
# imprimindo o conteudo da lista

a = dataset2[0]
print(a)

               0                                                  1  \
0     Capítulo I             Da Organização Político-Administrativa
1    Capítulo II                                           Da União
2   Capítulo III                              Dos Estados Federados
3    Capítulo IV                                     Dos Municípios
4     Capítulo V              Do Distrito Federal e dos Territórios
5        Seção I                                Do Distrito Federal
6       Seção II                                    Dos Territórios
7    Capítulo VI                                     Da Intervenção
8   Capítulo VII                           Da Administração Pública
9        Seção I                                 Disposições Gerais
10      Seção II                            Dos Servidores Públicos
11     Seção III  Dos Militares dos Estados, do Distrito Federal...
12      Seção IV                                        Das Regiões

             2
0   art. 18-19
1   art. 20-24
2   art. 25-28
3   art. 29-31
4   art. 32-33
5      art. 32
6      art. 33
7   art. 34-36
8   art. 37-43
9   art. 37-38
10  art. 39-41
11     art. 42
12     art. 43

In [28]:
# imprimindo primeira tabela da lista

bcs = pd.read_html('https://pt.wikipedia.org/wiki/Lista_dos_maiores_bancos_do_Brasil')
bcs = bcs[1]
print(bcs)

    Posição            Nome do banco   Cidade sede  \
0         1            Itaú Unibanco     São Paulo
1         2          Banco do Brasil      Brasília
2         3  Caixa Econômica Federal      Brasília
3         4                 Bradesco        Osasco
4         5         Santander Brasil     São Paulo
5         6              BTG Pactual     São Paulo
6         7              Banco Safra     São Paulo
7         8                   Sicoob      Brasília
8         9         Banco Votorantim     São Paulo
9        10          Citibank Brasil     São Paulo
10       11                 Banrisul  Porto Alegre
11       12        Banco do Nordeste     Fortaleza

   Ativos totais em R$ (bilhões)    Data dos dados  País de origem
0                       1.739[1]  Dezembro de 2019          Brasil
1                       1.540[2]  Dezembro de 2019          Brasil
2                       1.293[3]  Dezembro de 2019          Brasil
3                       1.152[4]  Dezembro de 2019          Brasil
4                       839,8[5]  Dezembro de 2019         Espanha
5                       176,6[6]  Dezembro de 2019          Brasil
6                       167,5[7]  Dezembro de 2019          Brasil
7                       117,2[6]  Dezembro de 2019          Brasil
8                        88,8[8]  Dezembro de 2019          Brasil
9                        88,5[9]  Dezembro de 2019  Estados Unidos
10                      80,9[10]  Dezembro de 2019          Brasil
11                      58,6[11]  Dezembro de 2019          Brasil

In [29]:
# importando dados de um arquivo JSON

with open('./data/skorea.json') as json_file:
    data = json.load(json_file)

In [30]:
# visualizando os dados

data

[{'Description': '',
  'Image': '/wiki/File:MuryeongsTomb.jpg',
  'Criteria': 'Cultural: (ii)(iii)',
  'Site': 'Baekje Historic Areas',
  'Area ha (acre)': '135 (330)',
  'Location': 'South Chungcheong, North Jeolla',
  'Year': '2015'},
 {'Description': '',
  'Image': '/wiki/File:Korea-Gwangju-Gochang_Dolmens_5350-06.JPG',
  'Criteria': 'Cultural: (iii)',
  'Site': 'Gochang, Hwasun and Ganghwa Dolmen Sites',
  'Area ha (acre)': '',
  'Location': 'Incheon, North Jeolla, South Jeolla',
  'Year': '2000'},
 {'Description': '',
  'Image': '/wiki/File:Juhamnu,_Changdeokgung_-_Seoul,_Korea.JPG',
  'Criteria': 'Cultural: (ii)(iii)(iv)',
  'Site': 'Changdeokgung Palace Complex',
  'Area ha (acre)': '',
  'Location': 'Seoul',
  'Year': '1997'},
 {'Description': '',
  'Image': '/wiki/File:Korea-Gyeongju-Bunhwangsa-Lanterns-03.jpg',
  'Criteria': 'Cultural: (ii)(iii)',
  'Site': 'Gyeongju Historic Areas',
  'Area ha (acre)': '2,880 (7,100)',
  'Location': 'North Gyeongsang',
  'Year': '2000'},
 {'Description': '',
  'Image': '/wiki/File:Haeinsa_Temple_(6222053899).jpg',
  'Criteria': 'Cultural: (iv)(vi)',
  'Site': 'Haeinsa Temple Janggyeong Panjeon, the Depositories for the Tripitaka Koreana Woodblocks',
  'Area ha (acre)': '',
  'Location': 'South Gyeongsang',
  'Year': '1995'},
 {'Description': '',
  'Image': '/wiki/File:Hahoe_8784.jpg',
  'Criteria': 'Cultural: (iii)(iv)',
  'Site': 'Historic Villages of Korea: Hahoe and Yangdong',
  'Area ha (acre)': '600 (1,500)',
  'Location': 'North Gyeongsang',
  'Year': '2010'},
 {'Description': '',
  'Image': '/wiki/File:Hwaseong2.jpg',
  'Criteria': 'Cultural: (ii)(iii)',
  'Site': 'Hwaseong Fortress',
  'Area ha (acre)': '',
  'Location': 'Gyeonggi',
  'Year': '1997'},
 {'Description': '',
  'Image': '/wiki/File:KOCIS_Halla_Mountain_in_Jeju-do_(6387785543).jpg',
  'Criteria': 'Natural: (vii)(viii)',
  'Site': 'Jeju Volcanic Island and Lava Tubes',
  'Area ha (acre)': '9,475 (23,410)',
  'Location': 'Jeju',
  'Year': '2007'},
 {'Description': '',
  'Image': '/wiki/File:Chongmyo_repository_(1509268349).jpg',
  'Criteria': 'Cultural: (iv)',
  'Site': 'Jongmyo Shrine',
  'Area ha (acre)': '19 (47)',
  'Location': 'Seoul',
  'Year': '1995'},
 {'Description': '',
  'Image': '/wiki/File:Khitai5.jpg',
  'Criteria': 'Cultural: (ii)(iv)',
  'Site': 'Namhansanseong',
  'Area ha (acre)': '409 (1,010)',
  'Location': 'Gyeonggi',
  'Year': '2014'},
 {'Description': '',
  'Image': '/wiki/File:Sejong_tomb_1.jpg',
  'Criteria': 'Cultural: (iii)(iv)(vi)',
  'Site': 'Royal Tombs of the Joseon Dynasty',
  'Area ha (acre)': '1,891 (4,670)',
  'Location': 'Gyeonggi, Seoul',
  'Year': '2009'},
 {'Description': '',
  'Image': '/wiki/File:Bulguk_Tempel.jpg',
  'Criteria': 'Cultural: (i)(iv)',
  'Site': 'Seokguram Grotto and Bulguksa Temple',
  'Area ha (acre)': '',
  'Location': 'North Gyeongsang',
  'Year': '1995'}]

In [31]:
# trasnformando os dados em dataframe

data = pd.DataFrame(data)

In [32]:
# visualizando os dados do dataframe

data.head()

,Description,Image,Criteria,Site,Area ha (acre),Location,Year
0,,/wiki/File:MuryeongsTomb.jpg,Cultural: (ii)(iii),Baekje Historic Areas,135 (330),"South Chungcheong, North Jeolla",2015
1,,/wiki/File:Korea-Gwangju-Gochang_Dolmens_5350-...,Cultural: (iii),"Gochang, Hwasun and Ganghwa Dolmen Sites",,"Incheon, North Jeolla, South Jeolla",2000
2,,"/wiki/File:Juhamnu,_Changdeokgung_-_Seoul,_Kor...",Cultural: (ii)(iii)(iv),Changdeokgung Palace Complex,,Seoul,1997
3,,/wiki/File:Korea-Gyeongju-Bunhwangsa-Lanterns-...,Cultural: (ii)(iii),Gyeongju Historic Areas,"2,880 (7,100)",North Gyeongsang,2000
4,,/wiki/File:Haeinsa_Temple_(6222053899).jpg,Cultural: (iv)(vi),"Haeinsa Temple Janggyeong Panjeon, the Deposit...",,South Gyeongsang,1995